# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [6]:
series1 = pd.Series(np.random.randint(1, high = 5, size = 100))
series1

0     4
1     2
2     1
3     1
4     3
     ..
95    1
96    3
97    3
98    2
99    2
Length: 100, dtype: int64

In [8]:
series2 = pd.Series(np.random.randint(1, high = 4, size = 100))
series2

0     3
1     2
2     2
3     2
4     3
     ..
95    1
96    3
97    1
98    2
99    3
Length: 100, dtype: int64

In [11]:
series3 = pd.Series(np.random.randint(10_000, high = 30_001, size = 100))
series3

0     22295
1     21257
2     18490
3     14549
4     24744
      ...
95    18749
96    17742
97    19828
98    27425
99    18842
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [13]:
housing = pd.concat([series1, series2, series3], axis = 1)
housing

    0  1      2
0   4  3  22295
1   2  2  21257
2   1  2  18490
3   1  2  14549
4   3  3  24744
.. .. ..    ...
95  1  1  18749
96  3  3  17742
97  3  1  19828
98  2  2  27425
99  2  3  18842

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [18]:
housing.rename(columns =  {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
housing

    bedrs  bathrs  price_sqr_meter
0       4       3            22295
1       2       2            21257
2       1       2            18490
3       1       2            14549
4       3       3            24744
..    ...     ...              ...
95      1       1            18749
96      3       3            17742
97      3       1            19828
98      2       2            27425
99      2       3            18842

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [20]:
bigcolumn = pd.concat([series1, series2, series3], axis = 0)
bigcolumn

0         4
1         2
2         1
3         1
4         3
      ...
95    18749
96    17742
97    19828
98    27425
99    18842
Length: 300, dtype: int64

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [ ]:
#No because the length of the dataframe is 300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [21]:
bigcolumn = pd.concat([series1, series2, series3], axis = 0, ignore_index = True)
bigcolumn

0          4
1          2
2          1
3          1
4          3
       ...
295    18749
296    17742
297    19828
298    27425
299    18842
Length: 300, dtype: int64